       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX03.
       AUTHOR. Guilherme, Nirley, Renato.
       INSTALLATION. FATEC-SP.
       DATE-WRITTEN. 15/08/2023.
       DATE-COMPILED.
       SECURITY. NAO TEM

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. DELL.
       OBJECT-COMPUTER. DELL.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADALU ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT CADATU ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD CADALU
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADALU.DAT".
       
       01 REG-ENT.
           02 NUMERO-LU PIC 9(05).
           02 NOME-LU PIC X(20).
           02 NOTA1-LU PIC 9(2)V99.
           02 NOTA2-LU PIC 9(2)V99.
           02 NOTA3-LU PIC 9(2)V99.

       FD CADATU
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADATU.DAT".

       01 REG-SAI.
           02 NUMERO-TU PIC 9(05).
           02 MEDIA-TU PIC 9(2)V99.

       WORKING-STORAGE SECTION.
           77 FIM-ARQ PIC X(03) VALUE "NAO".
           77 MEDIA PIC 9(2)V99 VALUE 0.

       PROCEDURE DIVISION.

       PGM-EX03.
           PERFORM INICIO.
           PERFORM PRINCIPAL 
               UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM TERMINO.
           STOP RUN.

       INICIO.
           OPEN INPUT CADALU
           OUTPUT CADATU.
           PERFORM LEITURA.
       
       LEITURA.
           READ CADALU
               AT END 
               MOVE "SIM" TO FIM-ARQ.
               
       PRINCIPAL.
           PERFORM GRAVACAO.
           PERFORM LEITURA.

       GRAVACAO.
           MOVE NUMERO-LU TO NUMERO-TU.
           COMPUTE MEDIA = (NOTA1-LU + NOTA2-LU + NOTA3-LU) / 3.
           MOVE MEDIA TO MEDIA-TU.
           WRITE REG-SAI.
           
       TERMINO.
           CLOSE CADALU
                 CADATU.
