       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX06.
       AUTHOR. Guilherme, Nirley, Renato.
       INSTALLATION. FATEC-SP.
       DATE-WRITTEN. 03/09/2023.
       DATE-COMPILED.
       SECURITY. NAO TEM

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. DELL.
       OBJECT-COMPUTER. DELL.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADENT ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT CADSAI ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD CADENT
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADENT.DAT".
       
       01 REG-ENT.
           02 MAT-ENT PIC 9(05).
           02 NOME-ENT PIC X(30).
           02 SAL-ENT PIC 9(5)V99.

       FD CADSAI
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADSAI.DAT".

       01 REG-SAI.
           02 MAT-SAI PIC 9(05).
           02 NOME-SAI PIC X(30).
           02 SAL-SAI PIC 9(5)V99.

       WORKING-STORAGE SECTION.
           77 FIM-ARQ PIC X(03) VALUE "NAO". 

       PROCEDURE DIVISION.

       PGM-EX06.
           PERFORM INICIO.
           PERFORM PRINCIPAL
               UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM TERMINO.
           STOP RUN.

       INICIO.
           OPEN INPUT CADENT
           OUTPUT CADSAI.
           PERFORM LEITURA.

       LEITURA.
           READ CADENT
               AT END 
               MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL.
           PERFORM GRAVACAO.
           PERFORM LEITURA.

       GRAVACAO.
           IF SAL-ENT > 03000,00
               MOVE MAT-ENT TO MAT-SAI
               MOVE NOME-ENT TO NOME-SAI
               MOVE SAL-ENT TO SAL-SAI
               WRITE REG-SAI.

       TERMINO.
           CLOSE CADENT
                 CADSAI.     